# [作業目標]

1. [簡答題] 請問下列四種不同的 DataFrame 選取結果有什麼差異？

```
df.loc[ '2013-01-01', 'A'] 
df.loc[ '2013-01-01', ['A', 'B'] ] 
df.loc[ '2013-01-01':'2013-01-02', 'A' ] 
df.loc[ '2013-01-01':'2013-01-05', 'A':'C'] 
```


2. 請根據提供的資料，選擇出下列的要求：

```
# - select the first 3 rows.
# - select the odd rows. (index = 1, 3, 5)
# - select the last 2 columns.
# - select the even columns. (index = 0, 2, 4)
```

3. 請根據提供的資料，選擇出下列的要求：

```
# - 1. filtered by first column > 20?
# - 2. filtered by first column + second column > 50
# - 3. filtered by first column < 30 or second column > 30
# - 4. filtered by total sum of row > 100
```

# 作業

### 1. [簡答題] 請問下列四種不同的 DataFrame 選取結果有什麼差異？

```
df.loc[ '2013-01-01', 'A'] 
df.loc[ '2013-01-01', ['A', 'B'] ] 
df.loc[ '2013-01-01':'2013-01-02', 'A' ] 
df.loc[ '2013-01-01':'2013-01-05', 'A':'C'] 
```

In [1]:
#df.loc[ '2013-01-01', 'A']        ==> index='2013-01-01',column=A
#df.loc[ '2013-01-01', ['A', 'B'] ]   ==> index='2013-01-01',column=A,B
#df.loc[ '2013-01-01':'2013-01-02', 'A' ] ==> index='2013-01-01'~'2013-01-0２',column=A
#df.loc[ '2013-01-01':'2013-01-05', 'A':'C']==> index='2013-01-01'~'2013-01-05',column=A~C

### 2. 請根據提供的資料，選擇出下列的要求：

```
# - select the first 3 rows.
# - select the odd rows. (index = 1, 3, 5)
# - select the last 2 columns.
# - select the even columns. (index = 0, 2, 4)
```

In [ ]:
# 記得先 Import 正確的套件

import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame(np.random.randn(6,3),columns=['col1','col2','col3'])
df

       col1      col2      col3
0 -0.356473  0.416922  0.603374
1  1.019115  1.476556 -0.045985
2 -1.572632 -0.711638  2.334710
3 -0.034724 -1.863701  0.695593
4  1.099302 -0.515687  0.834540
5  0.094543  0.911280 -0.352525

In [14]:
# - select the first 3 rows.
print(df[:3])
# - select the odd rows. (index = 1, 3, 5)
print(df.iloc[[1,3,5]])
# - select the last 2 columns.
print(df.tail(2))
# - select the even columns. (index = 0, 2, 4)
print(df.iloc[lambda x: x.index % 2 == 0])

       col1      col2      col3
0 -0.356473  0.416922  0.603374
1  1.019115  1.476556 -0.045985
2 -1.572632 -0.711638  2.334710
       col1      col2      col3
1  1.019115  1.476556 -0.045985
3 -0.034724 -1.863701  0.695593
5  0.094543  0.911280 -0.352525
       col1      col2      col3
4  1.099302 -0.515687  0.834540
5  0.094543  0.911280 -0.352525
       col1      col2      col3
0 -0.356473  0.416922  0.603374
2 -1.572632 -0.711638  2.334710
4  1.099302 -0.515687  0.834540

### 3. 請根據提供的資料，選擇出下列的要求：

```
# - 1. filtered by first column > 20?
# - 2. filtered by first column + second column > 50
# - 3. filtered by first column < 30 or second column > 30
# - 4. filtered by total sum of row > 100
```

In [15]:
df = pd.DataFrame(np.random.randint(10, 40, 60).reshape(-1, 4))
df

     0   1   2   3
0   27  30  21  36
1   25  24  14  35
2   30  19  10  27
3   26  38  20  12
4   38  33  37  17
5   19  13  35  18
6   10  32  25  33
7   33  11  19  19
8   32  20  37  30
9   10  36  16  36
10  29  27  16  26
11  16  23  19  36
12  32  38  11  12
13  11  17  39  14
14  31  32  25  21

In [44]:
# - 1. filtered by first column > 20?
print(df[df[0]>20])
# - 2. filtered by first column + second column > 50
print(df[df[0]+df[1]>50])
# - 3. filtered by first column < 30 or second column > 30
print(df[(df[0] < 30) & (df[1] > 30)])
# - 4. filtered by total sum of row > 100
print(df[df.sum(axis=1)>100])

     0   1   2   3
0   27  30  21  36
1   25  24  14  35
2   30  19  10  27
3   26  38  20  12
4   38  33  37  17
7   33  11  19  19
8   32  20  37  30
10  29  27  16  26
12  32  38  11  12
14  31  32  25  21
     0   1   2   3
0   27  30  21  36
3   26  38  20  12
4   38  33  37  17
8   32  20  37  30
10  29  27  16  26
12  32  38  11  12
14  31  32  25  21
    0   1   2   3
3  26  38  20  12
6  10  32  25  33
9  10  36  16  36
     0   1   2   3
0   27  30  21  36
4   38  33  37  17
8   32  20  37  30
14  31  32  25  21